In [1]:
import pandas as pd

In [2]:
kosdaq = pd.read_csv("kosdaq_day_17011046.csv")

In [22]:
nasdaq = pd.read_csv("nasdaq.csv")

In [23]:
kosdaq.head()

,통계표,계정항목,단위,변환,2022/02/17,2022/02/18,2022/02/21,2022/02/22,2022/02/23,2022/02/24,...,2023/02/03,2023/02/06,2023/02/07,2023/02/08,2023/02/09,2023/02/10,2023/02/13,2023/02/14,2023/02/15,2023/02/16
0,1.5.1.1. 주식시장(일),KOSDAQ지수,1996.07.01=1000,원자료,874.22,881.71,884.25,868.11,877.33,848.21,...,766.79,761.33,772.79,779.98,784.58,772.44,772.55,779.58,765.46,784.71

In [26]:
nasdaq.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2022-02-17,14004.190430,14020.820313,13704.700195,13716.719727,13716.719727,4278370000
1,2022-02-18,13735.400391,13762.400391,13465.559570,13548.070313,13548.070313,4501940000
2,2022-02-22,13424.360352,13618.719727,13249.650391,13381.519531,13381.519531,4849170000
3,2022-02-23,13511.750000,13533.780273,13032.169922,13037.490234,13037.490234,4639330000
4,2022-02-24,12587.879883,13486.110352,12587.879883,13473.589844,13473.589844,6180200000

In [7]:
kosdaq.melt()

       variable             value
0           통계표  1.5.1.1. 주식시장(일)
1          계정항목          KOSDAQ지수
2            단위   1996.07.01=1000
3            변환               원자료
4    2022/02/17            874.22
..          ...               ...
248  2023/02/10            772.44
249  2023/02/13            772.55
250  2023/02/14            779.58
251  2023/02/15            765.46
252  2023/02/16            784.71

[253 rows x 2 columns]

In [13]:
type(kosdaq.melt().iloc[5,0])

str

In [12]:
kosdaq.melt().iloc[5,0]

'2022/02/18'

In [14]:
import datetime as dt

In [35]:
kosdaq_sub = kosdaq.melt().iloc[4:,:]

In [43]:
kosdaq_sub = kosdaq_sub.rename(columns={"variable":"Date", "value":"Price"}).reset_index(drop=True)

In [28]:
pd.to_datetime(nasdaq["Date"]).dt.hour

0      0
1      0
2      0
3      0
4      0
      ..
245    0
246    0
247    0
248    0
249    0
Name: Date, Length: 250, dtype: int64

In [39]:
nasdaq_sub = nasdaq.loc[:,["Date","Close"]]

In [44]:
nasdaq_sub = nasdaq_sub.rename(columns={"Close":"Price"})

In [45]:
nasdaq_sub

           Date         Price
0    2022-02-17  13716.719727
1    2022-02-18  13548.070313
2    2022-02-22  13381.519531
3    2022-02-23  13037.490234
4    2022-02-24  13473.589844
..          ...           ...
245  2023-02-09  11789.580078
246  2023-02-10  11718.120117
247  2023-02-13  11891.790039
248  2023-02-14  11960.150391
249  2023-02-15  12070.589844

[250 rows x 2 columns]